app/Controllers/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `produk`
SELECT COUNT(*) AS `numrows`
FROM `supplier`
SELECT COUNT(*) AS `numrows`
FROM `admin`
SELECT COUNT(*) AS `numrows`
FROM `pegawai`
SELECT DATE_FORMAT(Tanggalpesanan, '%Y-%m') as bulan_tahun, SUM(Totalharga) as total
FROM `pesanan`
WHERE `Tanggalpesanan` >= '2024-12-16'
GROUP BY `bulan_tahun`
SELECT DATE_FORMAT(Tanggal, '%Y-%m') as bulan_tahun, SUM(Totalharga) as total
FROM `pembelian`
WHERE `Tanggal` >= '2024-12-16'
GROUP BY `bulan_tahun`
---
    public function index()
    {
        // 1. Data untuk Summary Cards
        $total_barang = (new ProdukModel())->countAllResults();
        $total_supplier = (new SupplierModel())->countAllResults();
        $total_user_aktif = (new AdminModel())->countAllResults() + (new PegawaiModel())->countAllResults();

        // 2. Data untuk Grafik Keuangan Bulanan (6 bulan terakhir)
        $laporan_keuangan_labels = [];
        $data_bulanan = [];
        for ($i = 5; $i >= 0; $i--) {
            $date = new DateTime(date('Y-m-01') . " -$i months");
            $month_year_key = $date->format('Y-m');
            $laporan_keuangan_labels[] = $date->format('M Y');
            $data_bulanan[$month_year_key] = ['pemasukan' => 0, 'pengeluaran' => 0];
        }

        $pesananModel = new PesananModel();
        $pemasukanData = $pesananModel->select("DATE_FORMAT(Tanggalpesanan, '%Y-%m') as bulan_tahun, SUM(Totalharga) as total")
            ->where('Tanggalpesanan >=', date('Y-m-d', strtotime('-6 months')))
            ->groupBy('bulan_tahun')->get()->getResultArray();

        foreach ($pemasukanData as $row) {
            if (isset($data_bulanan[$row['bulan_tahun']])) {
                $data_bulanan[$row['bulan_tahun']]['pemasukan'] = (float) $row['total'];
            }
        }

        $pembelianModel = new PembelianModel();
        $pengeluaranData = $pembelianModel->select("DATE_FORMAT(Tanggal, '%Y-%m') as bulan_tahun, SUM(Totalharga) as total")
            ->where('Tanggal >=', date('Y-m-d', strtotime('-6 months')))
            ->groupBy('bulan_tahun')->get()->getResultArray();

SELECT `Kategoriproduk`, COUNT(IDProduk) as jumlah
FROM `produk`
GROUP BY `Kategoriproduk`
ORDER BY `jumlah` DESC
---

        // 3. Data untuk Distribusi Kategori Barang
        $produkModel = new ProdukModel();
        $kategoriData = $produkModel->select('Kategoriproduk, COUNT(IDProduk) as jumlah')
            ->groupBy('Kategoriproduk')->orderBy('jumlah', 'DESC')->get()->getResultArray();

SELECT `p`.`Namaproduk`, SUM(ps.Jumlahitem) as total_terjual
FROM `pesanan` `ps`
LEFT JOIN `produk` `p` ON `ps`.`IDProduk` = `p`.`IDProduk`
GROUP BY `p`.`Namaproduk`
ORDER BY `total_terjual` DESC
 LIMIT 5
---

        // 4. LOGIKA BARU: Data untuk Top 5 Barang Sering Dibeli
        $db = db_connect();
        $topProdukData = $db->table('pesanan ps')
            ->select('p.Namaproduk, SUM(ps.Jumlahitem) as total_terjual')
            ->join('produk p', 'ps.IDProduk = p.IDProduk', 'left')
            ->groupBy('p.Namaproduk')
            ->orderBy('total_terjual', 'DESC')
            ->limit(5)
            ->get()->getResultArray();