app/Controllers/PembelianController.php

SELECT *
FROM `pembelian`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pembelian`
---
    public function index()
    {
        $pembelianModel = new PembelianModel();

        // Ambil keyword pencarian dari URL
        $keyword = $this->request->getGet('search') ?? '';

        // Siapkan query builder dengan atau tanpa keyword pencarian
        $queryBuilder = $pembelianModel->search($keyword);

        // Siapkan data untuk view
        $data = [
            'title'     => 'Data Pembelian',
            // Gunakan paginate() dari query builder, bukan findAll()
            'pembelian' => $queryBuilder->paginate(10, 'pembelian'), // 10 data per halaman, grup 'pembelian'