app/Controllers/PenjualanController.php

    public function index()
    {
        $pesananModel = new PesananModel();

        $data = [
            'title'     => 'Data Penjualan',
            // Ambil SEMUA data pesanan, karena akan diolah oleh DataTables
            'penjualan' => $pesananModel->orderBy('Tanggalpesanan', 'DESC')
                                       ->orderBy('IDPesanan', 'DESC')
                                       ->findAll(),
---
SELECT *
FROM `pesanan`
ORDER BY `Tanggalpesanan` DESC, `IDPesanan` DESC