app/Controllers/UserController.php

    public function index()
    {
        // Buat instance dari kedua model
        $adminModel = new AdminModel();
        $pegawaiModel = new PegawaiModel();

        // Siapkan data untuk dikirim ke view
        $data = [
            'title'   => 'Kelola User',
            // Ambil semua data dari tabel admin
            'admins'  => $adminModel->findAll(),
            // Ambil semua data dari tabel pegawai
            'pegawai' => $pegawaiModel->findAll(),
---
SELECT *
FROM `admin`
SELECT *
FROM `pegawai`